src/Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПеремещениеТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментарийПолный</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоТоваров</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ПеремещениеТоваров/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(_, __, ___)
    РаботаСДокументами.ЗаполнитьПолеАвторДокументаНаСервере(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(_, __)
    Если Товары.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;

    Движения.ТоварыНаСкладах.Записывать = Истина;

    Для Каждого текСтрокаТовары Из Товары Цикл
        движение = создатьДвижениеПоСкладам(ВидДвиженияНакопления.Расход);
        выполнитьДвижениеПоСкладамРасход(движение, текСтрокаТовары);

        движение = создатьДвижениеПоСкладам(ВидДвиженияНакопления.Приход);
        выполнитьДвижениеПоСкладамРасход(движение, текСтрокаТовары);
    КонецЦикла;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  видДвижения - ВидДвиженияНакопления - По умолчанию: ВидДвиженияНакопления.Приход
//
// Возвращаемое значение:
//  РегистрНакопленияЗапись.ТоварыНаСкладах - новое движение по складам
Функция создатьДвижениеПоСкладам(Знач видДвижения = Неопределено)
    видДвижения = ?(видДвижения = Неопределено, ВидДвиженияНакопления.Приход, видДвижения);
    движение = Движения.ТоварыНаСкладах.Добавить();
    движение.Период = Дата;
    движение.ВидДвижения = видДвижения;
    движение.Склад = ?(видДвижения = ВидДвиженияНакопления.Расход, СкладОтправитель, СкладПолучатель);

    Возврат движение;
КонецФункции

// Заполняет движение данными из ТЧ Товары
//
// Параметры:
//  движение - РегистрНакопленияЗапись.ТоварыНаСкладах
//  текСтрокаТовары - ДокументыТабличнаяЧастьСтрока.ПеремещениеТоваров.Товары
Процедура выполнитьДвижениеПоСкладамРасход(движение, текСтрокаТовары)
    движение.Номенклатура = текСтрокаТовары.Товар;
    движение.Количество = текСтрокаТовары.Количество;
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
